USE Lab_03;

--1. Перечень товаров и их количество на складе
SELECT Товары.ID_Товара, Товары.Наименование, Склад.Количество_товара
FROM Товары
INNER JOIN Склад ON Товары.ID_Товара = Склад.ID_Товара;

--2. Поиск товаров с "Телефон" в названии
SELECT Товары.ID_Товара, Товары.Наименование, Товары.Цена
FROM Товары
WHERE Товары.Наименование LIKE '%Телефон%';

--3. Найти сделки с товарами в определённом ценовом диапазоне
SELECT 
    Сделки.ID_Сделки,
    Покупатели.ФИО AS Покупатель,
    Товары.Наименование AS Товар,
    Товары.Цена,
    Сделки.Количество,
    CASE 
        WHEN Товары.Цена BETWEEN 500 AND 700 THEN 'Средний'
        WHEN Товары.Цена > 700 THEN 'Дорогой'
        ELSE 'Дешевый'
    END AS Категория
FROM Сделки
INNER JOIN Покупатели ON Сделки.ID_Покупателя = Покупатели.ID_Покупателя
INNER JOIN Товары ON Сделки.ID_Товара = Товары.ID_Товара
WHERE Товары.Цена BETWEEN 500 AND 1000
ORDER BY Товары.Цена DESC;

--4. Покупатели, которые не сделали покупок
SELECT Покупатели.ФИО,
       ISNULL(CAST(Сделки.ID_Сделки AS VARCHAR), 'Нет сделок') AS Сделка
FROM Покупатели
LEFT JOIN Сделки ON Покупатели.ID_Покупателя = Сделки.ID_Покупателя;


--5. Создать все возможные комбинации покупателей и товаров
SELECT Покупатели.ФИО AS Покупатель, Товары.Наименование AS Товар
FROM Покупатели
CROSS JOIN Товары;